hacUPB/micro-2420-eval-u3-JuanDiegoArturo/Proyecto Teclado PWM/pin_mux.h
/*
 * Copyright 2019 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*****************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 ****************************************/

#ifndef PIN_MUX_H
#define PIN_MUX_H

/*!
 * @addtogroup pin_mux
 * @{
 */

/*****************************************
 * API
 ****************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

#define BOARD_INITPINS_LED_RED_GPIO GPIOE /*!<@brief GPIO device name: GPIOE */
#define BOARD_INITPINS_LED_RED_PORT PORTE /*!<@brief PORT device name: PORTE */

//LED
#define BOARD_INITPINS_LED_RED_PIN 2U

//FILAS ---> SALIDAS
#define BOARD_INITPINS_FIL1_PIN 3U
#define BOARD_INITPINS_FIL2_PIN 4U
#define BOARD_INITPINS_FIL3_PIN 5U
#define BOARD_INITPINS_FIL4_PIN 6U

// COLUMNAS --> ENTRADAS
#define BOARD_INITPINS_COL1_PIN 9U
#define BOARD_INITPINS_COL2_PIN 10U
#define BOARD_INITPINS_COL3_PIN 11U
#define BOARD_INITPINS_COL4_PIN 12U


/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* PIN_MUX_H */

/*****************************************
 * EOF
 ****************************************/
